In [ ]:
pip install pandas

In [ ]:
pip install sqlalchemy

In [ ]:
pip install psycopg2

In [ ]:
import pandas as pd

In [8]:
df = pd.read_csv('weight-height-updated (2).csv')
df.head()

  Gender     Height      Weight  Born_Year
0   Male  73.847017  241.893563     1967.0
1   Male  68.781904  162.310473     1977.0
2   Male  74.110105  212.740856     1991.0
3   Male  71.730978  220.042470     1998.0
4   Male  69.881796  206.349801     1985.0

In [9]:
from sqlalchemy import create_engine

In [ ]:
engine = create_engine("postgresql://username:password@localhost:port/dbname")

In [20]:
df_1 = pd.read_sql("select * from health.bmi", engine)

In [21]:
df_1.head()

  Gender     Height      Weight  Born_Year
0   Male  73.847017  241.893563     1967.0
1   Male  68.781904  162.310473     1977.0
2   Male  74.110105  212.740856     1991.0
3   Male  71.730978  220.042470     1998.0
4   Male  69.881796  206.349801     1985.0

In [17]:
df.head()

  Gender     Height      Weight  Born_Year
0   Male  73.847017  241.893563     1967.0
1   Male  68.781904  162.310473     1977.0
2   Male  74.110105  212.740856     1991.0
3   Male  71.730978  220.042470     1998.0
4   Male  69.881796  206.349801     1985.0

In [19]:
df.to_sql('bmi', engine, if_exists='replace', index=False, schema='health')

1000